 **1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [3]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills',
                  'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

birds=pd.DataFrame(data,index=labels)

birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [5]:
birds.iloc[4]

print(grid_data)

[['spoonbills' 6.0]
 [3 'no']]

c:\program files\python36\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  This is separate from the ipykernel package so we can avoid doing imports until

**2. Display a summary of the basic information about birds DataFrame and its data.

In [162]:
birds.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe

In [161]:
birds[:2]

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe

In [160]:
#print(birds[birds.columns[[0, 1]]])

birds[['birds','age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']

In [198]:
birds[['birds','age','visits']].iloc[[1,2,6]]

birds[['birds','age','visits']].filter(items=['b','c','g'], axis=0)

     birds  age  visits
b   Cranes  4.0       4
c  plovers  1.5       3
g  plovers  5.5       2

**6. select the rows where the number of visits is less than 4

In [159]:
birds.where(birds['visits']<4).dropna()

        birds  age  visits priority
a      Cranes  3.5     2.0      yes
c     plovers  1.5     3.0       no
e  spoonbills  6.0     3.0       no
g     plovers  5.5     2.0       no
i  spoonbills  8.0     3.0       no
j  spoonbills  4.0     2.0       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN

In [167]:
birds[['birds','visits']][birds.age.isnull()]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4

In [204]:

birds.loc[(birds['birds'] == 'Cranes') & (birds['age'] < 4)]

#birds[(birds['birds'] == 'Cranes') & (birds['age'] < 4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)

In [208]:
birds[(birds.age>2) & (birds.age<=4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes

In [253]:
a=birds.where(birds['birds']=='Cranes').dropna()
print("Total number of visits of Crane :",a['visits'].sum())

Total number of visits of Crane : 10.0

**11. Calculate the mean age for each different birds in dataframe.

In [275]:

g=birds.groupby('birds')
print(g.mean())

'''for bird,birddf in g:
    print(bird,'\n',birddf,'\n')'''

            age  visits
birds
Cranes      3.5     3.0
plovers     3.5     2.5
spoonbills  6.0     3.0

"for bird,birddf in g:\n    print(bird,'\n',birddf,'\n')"

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.

In [322]:
birds1=birds.append({'birds':'Hen','age':'100','visits':'5','priority':'yes'},ignore_index=True)
birds1.rename(index={'k':'10'},inplace=True)

         birds  age visits priority
0       Cranes  3.5      2      yes
1       Cranes    4      4      yes
2      plovers  1.5      3       no
3   spoonbills  NaN      4      yes
4   spoonbills    6      3       no
5       Cranes    3      4       no
6      plovers  5.5      2       no
7       Cranes  NaN      2      yes
8   spoonbills    8      3       no
9   spoonbills    4      2       no
10         Hen  100      5      yes